haclongtd1994/Quadcopter_Using_STM32F4/SENSOR/main.h
/**
  ******************************************************************************
  * @file    GPIO/GPIO_IOToggle/main.h 
  * @author  MCD Application Team
  * @version V1.8.0
  * @date    04-November-2016
  * @brief   Header for main.c module
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2016 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H
//Dinh nghia ham
typedef void (*DutyCycleModifier)(float);
typedef void (*DutyCycleSetter)(float);
typedef float (*DutyCycleReader)();

typedef struct DutyCycle {
	DutyCycleSetter set;
	DutyCycleModifier update;
	DutyCycleReader get;
}DutyCycle;

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"

#if defined (USE_STM324xG_EVAL)
  #include "stm324xg_eval.h"

#elif defined (USE_STM324x7I_EVAL) 
  #include "stm324x7i_eval.h"

#elif defined (USE_STM324x9I_EVAL) 
  #include "stm324x9i_eval.h"

#else
 #error "Please select first the Evaluation board used in your application (in Project Options)"
#endif




#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include "delay_using_systick.h"
#include "pwm_output.h"


/* Exported define -----------------------------------------------------------*/
#if defined (USE_STM324xG_EVAL)
  #define LED1_PIN                         GPIO_Pin_6
  #define LED2_PIN                         GPIO_Pin_8

#endif /* USE_STM324xG_EVAL */

#if defined (USE_STM324x7I_EVAL)    
  #define LED1_PIN                         GPIO_Pin_6
  #define LED2_PIN                         GPIO_Pin_8

#endif /* USE_STM324x7I_EVAL */

#if defined (USE_STM324x9I_EVAL)    
  #define LED1_PIN                         GPIO_Pin_6
  #define LED2_PIN                         GPIO_Pin_7

#endif /* USE_STM324x9I_EVAL */

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
////////////////////SYSTICK////////////////////////////
#define SYSTICK_CSR         0xE000E010u
#define SYSTICK_RVR         0xE000E014u
#define SYSTICK_CVR         0xE000E018u

/* Exported functions ------------------------------------------------------- */

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
